Revit 2027 API
ElectricalLoadAreaData Methods
The ElectricalLoadAreaData type exposes the following members.
Methods
Name | Description
CreateElectricalLoadAreas |  Creates electrical load areas on all the empty plan circuits of the given level.
Dispose
(Inherited from SpatialElementDomainData)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetAreaBasedLoadIds |  Gets the area based load ids of the electrical load area to be included.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
HasCircuitsWithoutElectricalLoadAreas |  Checks whether there are any empty plan circuits in which there are no electrical load areas.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
ElectricalLoadAreaData Class
Autodesk.Revit.DB.Electrical Namespace